Autodesk.Revit.DB.BackgroundProcessTask.BackgroundProcessTaskExecutorOutput.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.BackgroundProcessTask.BackgroundProcessTaskExecutorOutput.#ctor(Autodesk.Revit.DB.ExtensibleStorage.Entity,Autodesk.Revit.DB.BackgroundProcessTask.BackgroundProcessTaskStatus)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.BackgroundProcessTask.BackgroundProcessTaskExecutorOutput
Combines the output data of the executor (ESEntity) with a status
value to declare what state the execution finished in